// Task2. Напишите программу, которая на вход принимает два числа и выдаёт,
// какое число большее, а какое меньшее.

// Console.Write("Input first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if (num1 > num2)
// {
//     Console.WriteLine($"Max number: {num1}");
// }
// else
// {
//     Console.WriteLine($"Max number: {num2}");
// }


// Task4. Напишите программу, которая принимает на вход три числа
// и выдаёт максимальное из этих чисел.

// Console.Write("Input first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input third number: ");
// int num3 = Convert.ToInt32(Console.ReadLine());
// int maximum = num1;
// if (num2 > maximum)
// {
//     maximum = num2;
// }
// if (num3 > maximum)
// {
//     maximum = num3;
// }
// Console.WriteLine($"Max number: {maximum}");


// Task6. Напишите программу, которая на вход принимает число и выдаёт,
// является ли число чётным (делится ли оно на два без остатка)

// Console.Write("Input number: ");
// int n = Convert.ToInt32(Console.ReadLine());
// if (n % 2 == 0)
// {
//     Console.WriteLine($"Число {n} чётное");
// }
// else
// Console.WriteLine($"Число {n} нечётное");


// Task8. Напишите программу, которая на вход принимает число (N),
// а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Input number: ");
// int n = Convert.ToInt32(Console.ReadLine());
// int count = 1;
// while (count<=n)
// {
//     if (count%2==0)
//     {
//         Console.Write(count);
//         Console.Write(" ");
//     }
//     count++;
// }
